/* 
	자동판매기 관리 프로그램

	<입력 및 출력형식>
	돈을 투입구에 넣어주세요.
	money =

	-----------<Coffee Menu>-----------
	1. Coffee(300원)
	2. Black Coffee(500원)
	3. Milk Coffee(700원)
	4. Ice Coffee(900원)
	-----------------------------------

	choice =

	<처리조건>
	1. 투입되는 돈은 0보다 커야한다.
		만약 그렇지 않다면 다시 돈을 입력받도록 구현한다.
	2. 메뉴가 출력되면 원하는 메뉴를 선택하도록 구현한다.
		단, 존재하지 않는 메뉴를 선택할 경우 "선택이 올바르지 않습니다." 라는 메시지를 출력한다.
	3. 선택된 메뉴의 금액이 투입된 금액보다 적을경우 금액이 부족합니다. 라는 메시지를 출력한다.
		그렇지 않으면 해당 금액을 차감한 후 잔액을 알려준다. 
	4. 구매가 정상적으로 처리된 후 계속 구매를 희망하는지 여부를 확인 후 프로그램을 동작한다.
		xxx가 준비되었습니다.
		잔액은 xxx입니다.
		계속(Y/N) = 
*/